src/cf/Catalogs/ФизическиеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>ФизическиеЛица</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/ФИО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>ФИО</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/ФизическиеЛица/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ФИО = СтрРазделить(Объект.Наименование, " ");
	НаборЗап = РегистрыСведений.ФИО.СоздатьНаборЗаписей();
	НаборЗап.Отбор.ФизЛицо.Установить(Объект.Ссылка);
	НаборЗап.Отбор.Период.Установить(Дата);
	НаборЗап.Прочитать();
	НаборЗап.Очистить();
	Зап = НаборЗап.Добавить();
	Зап.ФизЛицо = Объект.Ссылка;
	Зап.Период = Дата;
	Зап.Фамилия = ФИО[0];
	Зап.Имя = ФИО[1];
	Зап.Отчество = ФИО[2];
	НаборЗап.Записать();
КонецПроцедуры


&НаСервереБезКонтекста
Функция ФИОНаДату(Дата)
	ФИО = РегистрыСведений.ФИО.ПолучитьПоследнее(Дата);
	Возврат ФИО.Фамилия + " " + ФИО.Имя + " " + ФИО.Отчество;
КонецФункции



&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Объект.Наименование = ФИОНаДату(Дата);
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Дата = ТекущаяДата();
	Объект.Наименование = ФИОНаДату(Дата);
КонецПроцедуры
